{
  "excerpt": {
    "content": "<p>I rewrote my website and blog using <a href=\"https://nuxtjs.org/\">nuxt.js</a>. The experience did not come without a bit of blood, sweat, and tears, but I'm happy with the end result. This is not so much a tutorial as it is a reflection on the experience and why I did what I did.</p>\n",
    "loc": {
      "start": 0,
      "end": 288
    }
  },
  "author": "Anthony Koch",
  "title": "Just Nuxt Things",
  "tags": [
    "nuxt",
    "vue",
    "webpack"
  ],
  "id": 7,
  "created_at": "2018-07-29T00:00:00.000Z",
  "humanized": {
    "created_at": "July, 28 2018"
  },
  "url": "/blog/just-nuxt-things",
  "slug": "just-nuxt-things",
  "next": {
    "url": "/blog/use-normalize-css",
    "author": "Anthony Koch",
    "title": "Use normalize css",
    "tags": [
      "css",
      "normalize"
    ],
    "id": 8,
    "created_at": "2018-08-03T00:00:00.000Z"
  },
  "previous": {
    "url": "/blog/understanding-javascript-prototypes",
    "author": "Anthony Koch",
    "title": "Understanding JavaScript Prototypes",
    "tags": [
      "JavaScript",
      "prototypes"
    ],
    "id": 6,
    "created_at": "2016-01-21T00:00:00.000Z"
  },
  "contents": "<p>I rewrote my website and blog using <a href=\"https://nuxtjs.org/\">nuxt.js</a>. The experience did not come without a bit of blood, sweat, and tears, but I'm happy with the end result. This is not so much a tutorial as it is a reflection on the experience and why I did what I did.</p>\n<!-- endexcerpt -->\n<h3>What I wanted</h3>\n<p>Originally, I wrote this blog a couple years ago with jekyll. Jekyll uses something that is or closely resembles <a href=\"https://shopify.github.io/liquid/\">liquid templating</a>. I'm not really a fan of liquid or any templating language that obfuscates simple things into some obscure, verbose syntax (such as filters). Want to multiply two numbers together and then divide by 100?</p>\n<pre><code>{{ age | times: 2 | divided_by: 100 }}\n</code></pre>\n<p>Imagine doing even more complex math than this. It's absolutely terrible and takes forever to read. This would simply be <code>{{ age * 2 / 100 }}</code> in any other syntax that allows rendering expressions.</p>\n<p>Something with a better templating syntax was definitely in order, but I also wanted:</p>\n<ol>\n<li>For those who disable JavaScript by default (such as myself) to still be able to view most of the site.</li>\n<li>For everything to function as a single page app for those with JavaScript enabled.</li>\n<li>To be able to use Vue since it has a pretty good featured templating system.</li>\n</ol>\n<p>Thankfully, the good folks from <a href=\"https://zeit.co/\">Zeit</a> have my needs covered with their open source project Nuxt. Nuxt is a framework for creating Server Side Rendered (SSR) apps with Vue, but it can also be used to generate a static site.</p>\n<p>Nuxt offers pretty much everything I wanted. I could completely pre-render the website to a static site for users with JavaScript disabled while still being able to use Vue for those with it enabled. On top of everything, it also works as a single page app for users with JavaScript enabled. Wowee, sign me up!</p>\n<h3>I also wanted performance</h3>\n<p>The few tutorials I looked into on how to create a blog with Nuxt end up loading all posts on every single request, even pages completely unrelated to blogging. If each post is around 15KB of text, highlighted code blocks, etc., then we're talking <code>~4-6KB</code> gzipped for each post. Just 30 posts is 150K of already gzipped content being loaded on every page. For a small site with only a few posts, this might be ok, but as I write more and more in the future, this is going to add up to be quite a lot.</p>\n<p>It didn't seem like there were any modules in the community to turn markdown files into JSON with various metadata. So, being a DIY oriented person, I decided I would just write all of the functionality. I just needed to simply convert the posts to json and load them with axios in the post template.</p>\n<h3>Converting posts to json</h3>\n<p>My solution to convert the posts to JSON was to write a webpack plugin. I won't go into detail with code examples of how it works, because there's a lot of code that goes into it. If you want to see the source files, you can find <a href=\"https://github.com/anthonykoch/website/blob/master\">them in here</a> (look in <code>~/.webpack</code> and <code>nuxt.config.js</code>.</p>\n<p>Basically, I use <a href=\"https://github.com/anthonykoch/website/blob/master/plugins/bootstrap.js#L11\"><code>require.context</code> paired with <code>file-loader</code></a>  to <a href=\"https://github.com/anthonykoch/website/blob/master/nuxt.config.js#L136\">load the markdown files</a>. This setup makes the files available to the <a href=\"https://github.com/anthonykoch/website/blob/master/.webpack/transform-file-plugin.js\">webpack plugin I wrote</a> and from there allows me to <a href=\"https://github.com/anthonykoch/website/blob/master/nuxt.config.js#L159\">transform each post</a> into a JSON file with all the necessary metadata.</p>\n<p>This might not the best way to do it, but was the easiest I could think of with my limited knowledge of writing webpack loaders and plugins. One downside to this approach is the post page doesn't automatically update when making a change to the markdown file. I'm hoping to fix later on, but for now, I'll just have to use good old <code>ctrl+r</code>.</p>\n<h3>A major Nuxt gotcha</h3>\n<p>You can not fetch content from the same server when using <code>npm run generate</code>. For example, a request like this: <code>axios.get('/_nuxt/hello-world.json')</code> will fail when running <code>npm run generate</code> and you'll get this lovely little error message.</p>\n<pre><code>  nuxt:generate Generate file: /blog/understanding-javascript-prototypes/index.html +0ms\n  Error: connect ECONNREFUSED 127.0.0.1:3000\n\n  - util.js:1003 Object._errnoException\n    util.js:1003:13\n\n  - util.js:1024 _exceptionWithHostPort\n    util.js:1024:20\n\n  - net.js:1181 TCPConnectWrap.afterConnect [as oncomplete]\n    net.js:1181:14\n</code></pre>\n<p>This happens because the server doesn't actually run while <code>npm run generate</code> is going. I'm not sure why they decided to do that, but it is what it is.</p>\n<p>That's actually all irrelevant because you have to remember that Vue is not running inside a browser when running <code>npm run generate</code>, but inside of a node process. In a browser, axios would assume the root <code>/</code> to be the same domain (which is <code>localhost:3000</code>) but in a node process, the root <code>/</code> defaults to <code>127.0.0.1:80</code>. So, we end up having another problem in that axios is sending requests to the wrong place.</p>\n<h4>Solving the gotcha</h4>\n<p>I solved this in a hacky way with <a href=\"https://github.com/anthonykoch/website/blob/master/core/fetch.js\">the code below</a> and by keeping the dev server open in another terminal tab. This way, requests are sent to the dev server when running <code>npm run generate</code>.</p>\n<pre class=\"hljs\"><code><span class=\"hljs-comment\">// ~/core/fetch.js</span>\n<span class=\"hljs-keyword\">import</span> axios <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">'axios'</span>;\n\n<span class=\"hljs-keyword\">const</span> baseURL =\n  process.server\n      <span class=\"hljs-comment\">// I set this to 'http://localhost:3000' in the nuxt config</span>\n    ? process.env.app.baseUrl\n    : <span class=\"hljs-string\">'/'</span>;\n\n<span class=\"hljs-keyword\">const</span> request = axios.create({\n  baseURL,\n});\n\n<span class=\"hljs-keyword\">export</span> <span class=\"hljs-keyword\">default</span> request;\n</code></pre>\n<p>This code creates an instance of axios that prefixes requests with <code>http://localhost:3000</code> so that requests go to the development server when running <code>npm run generate</code>. When running in an actual browser, the requests will be sent to the same domain. Remember that requests starting with a <code>/</code> are relative to the domain the code is running from, so this ends up covering both cases when the app is running in development <code>localhost:3000</code> and production <code>anthonykoch.com</code>.</p>\n<p>With all of this in place, I was able to load a post as normal.</p>\n<pre class=\"hljs\"><code><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">template</span>&gt;</span>\n  <span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">h1</span>&gt;</span>{{ post.title }}<span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">h1</span>&gt;</span>\n<span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">template</span>&gt;</span>\n\n<span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">script</span>&gt;</span><span class=\"javascript\">\n<span class=\"hljs-comment\">// ~/pages/blog/_slug.vue</span>\n<span class=\"hljs-keyword\">import</span> axios <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">'@/core/fetch'</span>;\n\n<span class=\"hljs-keyword\">export</span> <span class=\"hljs-keyword\">default</span> {\n  asyncData({ params, error }) {\n    <span class=\"hljs-keyword\">return</span> axios.get(<span class=\"hljs-string\">`posts/<span class=\"hljs-subst\">${params.slug}</span>.json`</span>)\n      .then(<span class=\"hljs-function\">(<span class=\"hljs-params\">{ data: post }</span>) =&gt;</span> {\n        <span class=\"hljs-keyword\">return</span> {\n          post,\n        };\n      })\n      .catch(<span class=\"hljs-function\"><span class=\"hljs-params\">err</span> =&gt;</span> {\n        error({ <span class=\"hljs-attr\">statusCode</span>: <span class=\"hljs-number\">404</span>, <span class=\"hljs-attr\">message</span>: <span class=\"hljs-string\">'Post not found'</span> });\n      });\n  },\n};\n</span><span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">script</span>&gt;</span>\n</code></pre>\n<h3>Things I don't like</h3>\n<p>Besides the gotcha above, there's a few things I found annoying or didn't like about Nuxt.</p>\n<h4>Not a standard Vue app</h4>\n<p>The structure of the app strays from a normal Vue app. I would expect as much since we're not just dealing with Vue but with Server Side Rendering (SSR). However, the concept of <code>~/layouts</code> and automatic router configuration actually end up disallowing the use of some vue-router features, such as named routes and named slots (although it seems this <a href=\"https://github.com/nuxt/nuxt.js/issues/190\">will likely change in the future</a>).</p>\n<h4>Error page</h4>\n<p>When there's an error, it will show an overlay that goes away when you fix the error. This is pretty standard for a Vue or React app. But when the app errors and the page is refreshed, it will show the page below. Once the error is fixed, the page doesn't refresh and app doesn't come back. This means you have to manually refresh it. It's kind of annoying, but not the end of the world.</p>\n<figure>\n  <figcaption>\n    The nuxt error page\n  </figcaption>\n  <img src=\"/images/posts/just-nuxt-things/error-page+c.png\" alt=\"nuxt error page\">\n</figure>\n<h4>Scroll position</h4>\n<p>This isn't really a Nuxt thing, but something against <code>vue-router</code>. The scroll position doesn't get remembered on page refresh. They allow customizing this, but it's not done by default. I have to wonder if they don't include this by default because the logic for it is too buggy and/or too difficult to achieve.</p>\n<h3>The overall experience</h3>\n<p>Working with Nuxt has been an interesting experience. It took a pretty good amount of time for me to figure out how to get this all to work properly, but I'm pretty happy with the end result and it serves all my needs perfectly.</p>\n"
}